data = [
    ("солнечно", True),
    ("солнечно", True),
    ("солнечно", True),
    ("солнечно", False),
    ("облачно", True),
    ("облачно", True),
    ("облачно", True),
    ("облачно", False),
    ("дождь", True),
    ("дождь", False),
    ("дождь", False),
    ("снег", True),
    ("снег", False),
    ("снег", False),
    ("снег", False),
]

# События:
# A - человек выходит гулять или нет
# H_1 - солнечно
# H_2 - облачно
# H_3 - дождь
# H_4 - снег

# Вероятности
# P(H_1) = 4/15
# P(H_2) = 4/15
# P(H_3) = 3/15
# P(H_4) = 4/15

# P(A|H_1) = 3/4
# P(A|H_2) = 3/4
# P(A|H_3) = 1/3
# P(A|H_4) = 1/4

# P(A) = 4/15 * 3/4 + 4/15 * 3/4 + 3/15 * 1/3 + 4/15 * 1/4 = 23/42
# P(H_3|A) = (P(A|H_3) * P(H_3)) / P(A) = (1/3 * 3/15) / (23/42) = 14/115 = 0.12
